**New York City Taxi Fare Prediction - by David Guzzi**

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

pd.set_option('display.float_format', '{:.2f}'.format)

In [3]:
#Lectura y visualización de información
df = pd.read_csv('train_s.csv')
df.head()

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,17358777,2009-12-16 19:56:08.0000002,6.1,2009-12-16 19:56:08 UTC,-73.960564,40.769658,-73.965808,40.755327,1
1,53320139,2012-05-03 09:31:00.000000164,6.1,2012-05-03 09:31:00 UTC,-74.001433,40.735952,-73.991040,40.744595,1
2,42864741,2013-07-25 19:08:33.0000003,11.5,2013-07-25 19:08:33 UTC,-73.972948,40.743595,-73.994399,40.740419,1
3,26375625,2011-12-02 16:30:00.00000089,3.3,2011-12-02 16:30:00 UTC,-73.966550,40.767238,-73.966448,40.767265,1
4,41418930,2014-01-08 03:43:57.0000001,19.5,2014-01-08 03:43:57 UTC,-73.975016,40.749072,-73.891663,40.769113,1

In [4]:
#Eliminación de primera columna
df = df.iloc[:,1:]
df.head()

,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,2009-12-16 19:56:08.0000002,6.1,2009-12-16 19:56:08 UTC,-73.960564,40.769658,-73.965808,40.755327,1
1,2012-05-03 09:31:00.000000164,6.1,2012-05-03 09:31:00 UTC,-74.001433,40.735952,-73.991040,40.744595,1
2,2013-07-25 19:08:33.0000003,11.5,2013-07-25 19:08:33 UTC,-73.972948,40.743595,-73.994399,40.740419,1
3,2011-12-02 16:30:00.00000089,3.3,2011-12-02 16:30:00 UTC,-73.966550,40.767238,-73.966448,40.767265,1
4,2014-01-08 03:43:57.0000001,19.5,2014-01-08 03:43:57 UTC,-73.975016,40.749072,-73.891663,40.769113,1

In [5]:
#Detalles generales de la información
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1662716 entries, 0 to 1662715
Data columns (total 8 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   key                1662716 non-null  object
 1   fare_amount        1662716 non-null  float64
 2   pickup_datetime    1662716 non-null  object
 3   pickup_longitude   1662716 non-null  float64
 4   pickup_latitude    1662716 non-null  float64
 5   dropoff_longitude  1662706 non-null  float64
 6   dropoff_latitude   1662706 non-null  float64
 7   passenger_count    1662716 non-null  int64
dtypes: float64(5), int64(1), object(2)
memory usage: 101.5+ MB

In [6]:
#Corroboramos que sean registros únicos
df['key'].nunique()

1662716

In [7]:
#Adecuamos formato a columna 'pickup_datetime' y corroboramos
df['pickup_datetime'] = pd.to_datetime(df['pickup_datetime'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1662716 entries, 0 to 1662715
Data columns (total 8 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   key                1662716 non-null  object
 1   fare_amount        1662716 non-null  float64
 2   pickup_datetime    1662716 non-null  datetime64[ns, UTC]
 3   pickup_longitude   1662716 non-null  float64
 4   pickup_latitude    1662716 non-null  float64
 5   dropoff_longitude  1662706 non-null  float64
 6   dropoff_latitude   1662706 non-null  float64
 7   passenger_count    1662716 non-null  int64
dtypes: datetime64[ns, UTC](1), float64(5), int64(1), object(1)
memory usage: 101.5+ MB

In [13]:
#Exploraremos las posibles relaciones del Target con los Features de forma individual. Primero: 'passenger_count'
#Exploraremos la variable o target a predecir: 'fare_amount'
df[['fare_amount']].describe()

       fare_amount
count   1662716.00
mean         11.33
std           9.82
min         -52.00
25%           6.00
50%           8.50
75%          12.50
max         850.00

In [23]:
# df[(df['pickup_longitude'] == df['dropoff_longitude']) & (df['pickup_latitude'] == df['dropoff_latitude'])]